# Pandas

## Introduction

Pandas is made to work with data. Actually the name Pandas is derived from the econometrics term panel date. Panel data is longitudinal data, i.e the data on how a variable changes over time.

Pandas introduces to main data structures into Python:
- Pandas Series, to work with labeled data, i.e. tagged with a label to get meaning
- Pandas DataFrame, to work with relational data i.e. tuples that relate to each other

In [ ]:
!conda list pandas

In [ ]:
!conda list pandas

Why work with Pandas as a financial data analyst?
- allows the use of labels for rows and columns
- Can calculate rolling statistics on time series data
- Easy handling of NaN values
- Is able to load data of different formats into DataFrames
- Can join and merge different datasets together
- It integrates with NumPy and Matplotlib

In [ ]:
# when importing pandas, use the standard alias, pd
import pandas as pd

## Pandas Series

In [ ]:
# let's create a series, representing some major historical financial crisis
financial_crisis = pd.Series(data=['400BC to Middle Ages', 1340, '16th century', 1637, 1720, 1929],
                             index=['Currency_Debasement: Greek / Roman / Byzantine empires', 
                                    'England default', 'Spain defaults 7x', 'Tulip Mania', 'South Sea Bubble',
                                   'Wall Street Crash / Great Depression'])
print(financial_crisis)
# difference to Numpy arrays: 
# 1. a pandas series can include various data types, 
#2. you can assign an index label to each element in the pandas series




financial_crisis.index

In [ ]:
financial_crisis.shape

In [ ]:
financial_crisis.size

In [ ]:
financial_crisis.ndim

In [ ]:
'tech crash' in financial_crisis

In [ ]:
# We can access the elements in multiple ways
# We can use the index labels to access the elements
financial_crisis['England default']

In [ ]:
# We can use lists of index labels
financial_crisis[['England default', 'Tulip Mania']]

In [ ]:
# We can use numeric indices
financial_crisis[0]

In [ ]:
# We can use numeric indices
financial_crisis[-1]

# This is very similar to how we access elements in NumPy arrays

In [ ]:
# We can use lists of numeric indices
financial_crisis[[0,1]]

In [ ]:
# To avoid ambiguity between index label and index, we can use the loc or iloc attributes.
# loc means location and points to an index label
# iloc mean integer location and points to a numeric index

financial_crisis.loc['Tulip Mania']

In [ ]:
financial_crisis.iloc[-2]

In [ ]:
# Pandas series are mutable, i.e. we can change the elements of the series after it's been created
financial_crisis.loc['Wall Street Crash / Great Depression'] = '1929 - 1932'
print(financial_crisis)

In [ ]:
# We can also delete elements using the drop method
financial_crisis.drop('Spain defaults 7x')

In [ ]:
# this only changes out of place and the original series remains unchanged
print(financial_crisis)

In [ ]:
# we can also change this in place, by setting the parameter inpace to True inside the drop method
financial_crisis.drop('Spain defaults 7x', inplace = True)
print(financial_crisis)

## Arithmetic operations

In [ ]:
# Arithmetic operations between Pandas series and single numbers
information_ratio = pd.Series([40,50], ['Manager_A', 'Manager_B'])
print(information_ratio)

In [ ]:
information_ratio + 2

In [ ]:
information_ratio - 2

In [ ]:
information_ratio * 1.2

In [ ]:
information_ratio / 2

In [ ]:
# we can also use mathematical funcions from NumPy and apply those to the Pandas series
# so let's import NumPy
import numpy as np

In [ ]:
np.sqrt(information_ratio)

In [ ]:
np.exp(information_ratio)

In [ ]:
np.power(information_ratio,2)

In [ ]:
# we can also appla the arithmetical operations to selected elements only
print(information_ratio)

In [ ]:
information_ratio['Manager_A'] + 2

In [ ]:
information_ratio.iloc[1] - 2

In [ ]:
information_ratio[['Manager_A', 'Manager_B']] * 1.5

In [ ]:
information_ratio.loc[['Manager_A', 'Manager_B']] * 1.5

In [ ]:
# Only show those Managers with an IR > 45
information_ratio[information_ratio > 45]

## Pandas DataFrame

A DataFrame is two-dimensional object with labelled rows and columns. Think of it like a table in Excel. It can hold various data types. It can be created manually or by loading data from a file. 

We will start by creating a data frame manually from a dictionary, holding various data series.

In [ ]:
requirements = {'Job_A': pd.Series(data = [2, 300000], index = ['FTE', 'Budget']),
                 'Job_B': pd.Series(data = [6, 2], index = ['FTE', 'Programmers'])}

In [ ]:
type(requirements)

In [ ]:
job_requirements = pd.DataFrame(requirements)
job_requirements

# The column names are taken alphabetically from the keys of the dictionary
# The rows are taken from the union of the indices. It will use numerical row indices if there are now labels given.
# NaN stands for not a number

In [ ]:
data = {'Job_A': pd.Series(data = [2, 300.000]),
                 'Job_B': pd.Series(data = [6, 2])}
job_requirements = pd.DataFrame(data)
job_requirements

In [ ]:
job_requirements.index

In [ ]:
job_requirements.values

In [ ]:
job_requirements.columns

In [ ]:
job_requirements.shape

In [ ]:
job_requirements.ndim

In [ ]:
job_requirements.size

In [ ]:
# We can also select which data from a dictionary we want to put into the data frame
# use the keyword column
job_a_requirements = pd.DataFrame(requirements, columns = ['Job_A'])
job_a_requirements

In [ ]:
# use the keyword index
FTE = pd.DataFrame(requirements, index = ['FTE'])
FTE

In [ ]:
# you can also' take a dictionary of lists and then pass it into the data frame
numbers = {'integers': [1,2,3], 'floats': [1.1, 2.1, 3.1]}
numbers_df = pd.DataFrame(numbers)
numbers_df

In [ ]:
# you can label the rows in the data frame
numbers_df = pd.DataFrame(numbers, index = ['number_1', 'number_2','number_3'])
numbers_df

In [128]:
# we can also load a list of Python dictionaries into a data frame
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame 
store_items = pd.DataFrame(items2)

# We display the DataFrame
store_items

   bikes  glasses  pants  watches
0     20      NaN     30       35
1     15     50.0      5       10

In [129]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

# We display the DataFrame
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

### Accessing elements in the data frame

In [130]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [131]:
store_items[['bikes', 'glasses']]

         bikes  glasses
store 1     20      NaN
store 2     15     50.0

In [132]:
store_items.loc[['store 1']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [133]:
# if you access a certain element, the column name always comes first
store_items['bikes']['store 1']
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [134]:
# add a column
store_items['shirts'] = [10,20]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      10
store 2     15     50.0      5       10      20

In [135]:
store_items['combi'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  glasses  pants  watches  shirts  combi
store 1     20      NaN     30       35      10     40
store 2     15     50.0      5       10      20     25

In [138]:
# To add rows, we have to create a new data frame with those rows and then append it to the original data frame
# We create a dictionary from a list of Python dictionaries that will number of items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# We display the items at the new store
new_store

# We append store 3 to our store_items DataFrame
store_items = store_items.append(new_store, sort = False)

# We display the modified DataFrame
store_items

         bikes  glasses  pants  watches  shirts  combi
store 1     20      NaN     30       35    10.0   40.0
store 2     15     50.0      5       10    20.0   25.0
store 3     20      4.0     30       35     NaN    NaN

In [139]:
store_items

         bikes  glasses  pants  watches  shirts  combi
store 1     20      NaN     30       35    10.0   40.0
store 2     15     50.0      5       10    20.0   25.0
store 3     20      4.0     30       35     NaN    NaN

In [140]:
# We insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])

# we display the modified DataFrame
store_items

         bikes  glasses  pants  watches  shoes  shirts  combi
store 1     20      NaN     30       35      8    10.0   40.0
store 2     15     50.0      5       10      5    20.0   25.0
store 3     20      4.0     30       35      0     NaN    NaN

In [141]:
# We change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

# we display the modified DataFrame
store_items

         hats  glasses  pants  watches  shoes  shirts  combi
store 1    20      NaN     30       35      8    10.0   40.0
store 2    15     50.0      5       10      5    20.0   25.0
store 3    20      4.0     30       35      0     NaN    NaN

In [142]:
# We remove the store 3 row
store_items = store_items.drop(['store 3'], axis = 0)

# we display the modified DataFrame
store_items

         hats  glasses  pants  watches  shoes  shirts  combi
store 1    20      NaN     30       35      8    10.0   40.0
store 2    15     50.0      5       10      5    20.0   25.0

In [145]:
# We change the row label from store 2 to last store
store_items = store_items.rename(index = {'store 2': 'last store'})

# we display the modified DataFrame
store_items

            hats  glasses  pants  watches  shoes  shirts  combi
store 1       20      NaN     30       35      8    10.0   40.0
last store    15     50.0      5       10      5    20.0   25.0

### Dealing with NaN
Before we put data into our learning algorithms (machine learning), we need to clean it, correct errors, etc.

In [146]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [147]:
# We count the number of NaN values in store_items
x =  store_items.isnull().sum().sum()

# We print x
print('Number of NaN values in our DataFrame:', x)

#isnull transforms NaN to True and all others to false
# True has a value of 1. the first sum sums up each column
# the secon sum sums up the entire dataframe

Number of NaN values in our DataFrame: 3

In [148]:
# count how many values you have per column
# We print the number of non-NaN values in our DataFrame
print()
print('Number of non-NaN values in the columns of our DataFrame:\n', store_items.count())

Number of non-NaN values in the columns of our DataFrame:
 bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [149]:
# use dropna to eliminate rows or columns with NaN values
# We drop any rows with NaN values
store_items.dropna(axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [150]:
# We drop any columns with NaN values
store_items.dropna(axis = 1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

Notice that the .dropna() method eliminates (drops) the rows or columns with NaN values out of place. This means that the original DataFrame is not modified. You can always remove the desired rows or columns in place by setting the keyword inplace = True inside the dropna() function.

In [151]:
'''Now, instead of eliminating NaN values, we can replace them with suitable values. 
We could choose for example to replace all NaN values with the value 0. 
We can do this by using the .fillna() method as shown below.'''

# We replace all NaN values with 0
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

In [152]:
'''We can also use the .fillna() method to replace NaN values with previous values in the DataFrame, 
this is known as forward filling. When replacing NaN values with forward filling, we can use previous
values taken from columns or rows. The .fillna(method = 'ffill', axis) will use the forward filling (ffill) method 
to replace 
NaN values using the previous known value along the given axis. Let's see some examples:'''
# We replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [153]:
# We replace NaN values with the next value in the column
store_items.fillna(method = 'backfill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [154]:
# We replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [155]:
# We replace NaN values by using linear interpolation using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

### Loading data into a data frame

In actual work, it's most likely to load data from other data source. We can use various formats for that. One of the most popular ones is csv.  We can load CSV files into Pandas DataFrames using the pd.read_csv() function.

In [6]:
import pandas as pd

# We load Google stock data in a DataFrame
Google_stock = pd.read_csv('./goog-1.csv')

# We print some information about Google_stock
print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (3313, 7)

In [8]:
# We can take a look at the first 5 rows of data using the .head() method, as shown below
Google_stock.head()

#We can also take a look at the last 5 rows of data by using the .tail() method:
Google_stock.tail()

'''We can also optionally use .head(N) or .tail(N) to display the first and last N rows of data, respectively.

Let's do a quick check to see whether we have any NaN values in our dataset. To do this, 
we will use the .isnull() method followed by the .any() method 
to check whether any of the columns contain NaN values.'''

"We can also optionally use .head(N) or .tail(N) to display the first and last N rows of data, respectively.\n\nLet's do a quick check to see whether we have any NaN values in our dataset. To do this, \nwe will use the .isnull() method followed by the .any() method \nto check whether any of the columns contain NaN values."

In [9]:
# We get descriptive statistics on our stock data
Google_stock.describe()

# We get descriptive statistics on a single column of our DataFrame
Google_stock['Adj Close'].describe()

# We print information about our DataFrame  
print()
print('Maximum values of each column:\n', Google_stock.max())
print()
print('Minimum Close value:', Google_stock['Close'].min())
print()
print('Average value of each column:\n', Google_stock.mean())

Maximum values of each column:
 Date         2017-10-13
Open                992
High             997.21
Low                 989
Close            989.68
Adj Close        989.68
Volume         82768100
dtype: object

Minimum Close value: 49.681866

Average value of each column:
 Open         3.801861e+02
High         3.834937e+02
Low          3.765193e+02
Close        3.800725e+02
Adj Close    3.800725e+02
Volume       8.038476e+06
dtype: float64

In [10]:
# We display the correlation between columns
Google_stock.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

In [11]:
# We display the total amount of money spent in salaries each year
data.groupby(['Year'])['Salary'].sum()

#We display the average salary per year
data.groupby(['Year'])['Salary'].mean()

NameError: name 'data' is not defined

In [12]:
# We display the total salary each employee received in all the years they worked for the company
data.groupby(['Name'])['Salary'].sum()

NameError: name 'data' is not defined

In [13]:
# We display the salary distribution per department per year.
data.groupby(['Year', 'Department'])['Salary'].sum()

NameError: name 'data' is not defined